nicknickeryt/eSokol/firmware/stm32/helpers/18b20_mot/Core/Src/wire.c
#include "wire.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_tim.h"

TIM_HandleTypeDef htimDelay;

HAL_StatusTypeDef wire_init(TIM_HandleTypeDef *htim) {

	htimDelay = *htim;
	return HAL_TIM_Base_Start(&htimDelay);
}

static void delay_us(uint32_t us) {
	__HAL_TIM_SET_COUNTER(&htimDelay, 0);

	while (__HAL_TIM_GET_COUNTER(&htimDelay) < us) {
	}
}

HAL_StatusTypeDef wire_reset(void) {
	int rc;

	HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_RESET);
	delay_us(480);
	HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_SET);
	delay_us(70);
	rc = HAL_GPIO_ReadPin(DS_GPIO_Port, DS_Pin);
	delay_us(410);

	if (rc == 0)
		return HAL_OK;
	else
		return HAL_ERROR;
}

static int read_bit(void) {
	int rc;
	HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_RESET);
	delay_us(6);
	HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_SET);
	delay_us(9);
	rc = HAL_GPIO_ReadPin(DS_GPIO_Port, DS_Pin);
	delay_us(55);
	return rc;
}

uint8_t wire_read(void) {
	uint8_t value = 0;
	int i;
	for (i = 0; i < 8; i++) {
		value >>= 1;
		if (read_bit())
			value |= 0x80;
	}
	return value;
}

static void write_bit(int value) {
	if (value) {
		HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_RESET);
		delay_us(6);
		HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_SET);
		delay_us(64);
	} else {
		HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_RESET);
		delay_us(60);
		HAL_GPIO_WritePin(DS_GPIO_Port, DS_Pin, GPIO_PIN_SET);
		delay_us(10);
	}
}

void wire_write(uint8_t byte) {
	int i;
	for (i = 0; i < 8; i++) {
		write_bit(byte & 0x01);
		byte >>= 1;
	}
}

static uint8_t byte_crc(uint8_t crc, uint8_t byte) {
	int i;
	for (i = 0; i < 8; i++) {
		uint8_t b = crc ^ byte;
		crc >>= 1;
		if (b & 0x01)
			crc ^= 0x8c;
		byte >>= 1;
	}
	return crc;
}

uint8_t wire_crc(const uint8_t *data, int len) {
	int i;
	uint8_t crc = 0;

	for (i = 0; i < len; i++)
		crc = byte_crc(crc, data[i]);

	return crc;
}
